Hi,
Regarding “since secondary_ip_ranges is converted to an attribute, it means you can accomplish the same without dynamic via direct assignment, e.g.:
           secondary_ip_ranges = var.secondary_ip_ranges” “
I tried this using the ‘secondary_ip_ranges’ as an attribute, but It didn’t work.

So this seems to be a bug where dynamic block is not working in compute_subnetwork  once we have sets of ‘secondary_ip_range’ values and then deleting the secondary_ip_range values.

The other thing is that it is working fine when we are trying to delete single value of secondary_ip_range and deploy with single secondary_ip_range.

Let me try to explain the complete scenario:
My current design is to implement a scalable architecture so, modularized code looks like various sections like main.tf and vars.tf and outputs.tf.
main.tf
--------
locals {
  enable_flow_logs       = true
  log_config_metadata    = "INCLUDE_ALL_METADATA"
  name                   = slice(split("/", var.network_link), 9, 10)
}
resource "google_compute_subnetwork" "self" {
 name          = var.subnet_purpose == "" ? format("%s-%s", local.name[0], var.region) : format("%s-%s-%s", local.name[0], var.region, var.subnet_purpose)
  description   = var.description
  region        = var.region
  network       = var.network_link
  project       = var.project
  ip_cidr_range = var.ip_cidr_range
  private_ip_google_access = var.private_ip_google_access
  enable_flow_logs = local.enable_flow_logs
  dynamic "secondary_ip_range" {
     for_each = var.secondary_ip_ranges
     iterator = ip_range_map
     content  {
          range_name = lookup(ip_range_map.value, "range_name")
          ip_cidr_range = lookup(ip_range_map.value, "ip_cidr_range")
    }
   }
}
And declaring variables in vars.tf
Now coming to testing part,  I’ve written modules assigning some default values. (main.tf and loading secondary_ip_range values in json)
main.tf
--------
variable "secondary_ip_ranges" {
        type = list(object({
            range_name = string
            ip_cidr_range = string
}))
        default = []
}
module "test_network" {
  source      = "git ……"
 project     = "……."
  description = "TEST NETWORK"
  vpc_id      = 1
}

module "test_subnetwork" {
  source        = "../../compute/subnetwork"
  project       = "…"
  network_link  = module.test_network.vpc_network_output
  description   = "TEST-SUBNETWORK"
  region        = "…"
  ip_cidr_range = "…."
  private_ip_google_access = false
  secondary_ip_ranges = var.secondary_ip_ranges
}  
secondary_ip_ranges.auto.tfvars.json
--------------------------------------------------
{
   "secondary_ip_ranges" : [
    {
     "range_name"    : "tf-test-secondary-range-update1",
     "ip_cidr_range" : "…"
    },
    {
    "range_name"    : "tf-test-secondary-range-update2",
     "ip_cidr_range" : "…."
    }
   ]
}
Scenarios:
1)      created subnetwork with 2 sets of secondary_ip_ranges --- > able to see the config when ran terraform plan and once ran apply noticed 2 sets of secondary_ip_range in console
terraform plan:
$ /opt/terraform/terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
------------------------------------------------------------------------
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
Terraform will perform the following actions:
  # module.test_network.google_compute_network.self will be created
  + resource "google_compute_network" "self" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = true
      + description                     = "TEST NETWORK"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + name                            = "…"
      + project                         = "…"
      + routing_mode                    = "REGIONAL"
     + self_link                       = (known after apply)
    }
  # module.test_subnetwork.google_compute_subnetwork.self will be created
  + resource "google_compute_subnetwork" "self" {
     + creation_timestamp       = (known after apply)
      + description              = "TEST-SUBNETWORK"
      + enable_flow_logs         = true
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "…."
      + name                     = (known after apply)
      + network                  = (known after apply)
      + private_ip_google_access = false
     + project                  = "…."
      + region                   = "europe-west1"
      + self_link                = (known after apply)
      + secondary_ip_range {
          + ip_cidr_range = "…."
          + range_name    = "…."
        }
      + secondary_ip_range {
          + ip_cidr_range = "…."
          + range_name    = "…"
        }
    }
Plan: 2 to add, 0 to change, 0 to destroy.
------------------------------------------------------------------------
Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

2)      Deleted one set of secondary_ip_range --- > able to see the changes set to null  in config for one set and can see only one set of secondary_ip_range in console
$ /opt/terraform/terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
module.test_network.google_compute_network.self: Refreshing state... []
module.test_subnetwork.google_compute_subnetwork.self: Refreshing state... [id=europe-west1/hsbc-320774-sharedsvcs2-dev-vpc1-europe-west1]
------------------------------------------------------------------------
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
 Terraform will perform the following actions:
  # module.test_subnetwork.google_compute_subnetwork.self will be updated in-place
  ~ resource "google_compute_subnetwork" "self" {
       creation_timestamp       = "2019-06-18T11:13:20.275-07:00"
        description              = "….."
        enable_flow_logs         = true
        fingerprint              = "_JI9R6rGZiY="
        gateway_address          = "…."
        id                       = "…."
        ip_cidr_range            = "…"
        name                     = "…."
        network                  = "…."
        private_ip_google_access = false
        project                  = "…."
        region                   = "…"
        self_link                = "…."
        secondary_ip_range {
            ip_cidr_range = "…."
            range_name    = "…"
        }
      - secondary_ip_range {
          - ip_cidr_range = "....." -> null
          - range_name    = "…." -> null
        }
    }
Plan: 0 to add, 1 to change, 0 to destroy.
3) Deleted the other set  also  (renamed json file )--- > able to see the changes set to null  in config config when ran terraform plan  but still able to see secondary_ip_range  value in console
    $ /opt/terraform/terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
module.test_network.google_compute_network.self: Refreshing state... []

module.test_subnetwork.google_compute_subnetwork.self: Refreshing state... []
module.test_router.google_compute_router.self: Refreshing state... []
------------------------------------------------------------------------
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
 Terraform will perform the following actions:
   # module.test_subnetwork.google_compute_subnetwork.self will be updated in-place
 ~ resource "google_compute_subnetwork" "self" {
        creation_timestamp       = “ ”
        description              = "TEST-SUBNETWORK"
        enable_flow_logs         = true
        fingerprint              = "  ="
        gateway_address          = "…."
        id                       = "…."
        ip_cidr_range            = "…."
        name                     = "…."
        network                  = "…"
        private_ip_google_access = false
        project                  = "….                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
        region                   = ""
        self_link                = " "
      - secondary_ip_range {
          - ip_cidr_range = "…" -> null
          - range_name    = "…." -> null
       }
    }
Plan: 0 to add, 1 to change, 0 to destroy.